import { Routes, Route, Link, useParams } from "react-router-dom";
import { useState } from "react";
import './App.css'

function App() {

  let kanjiArr = [
    {
      day: '1일차 (26.05.08)',
      words: [
        ["最も", "もっとも", "가장"],
        ["運動", "うんどう", "운동"],
        ["汗", "あせ", "땀"],
        ["指示", "しじ", "지시"],
        ["辺り", "あたり", "근처"],
        ["事件", "じけん", "사건"],
        ["事故", "じこ", "사고"],
        ["期限", "きげん", "기한"],
        ["料金", "りょうきん", "요금"],
        ["払う", "はらう", "지불하다"],
        ["返す", "かえす", "돌려주다"],
        ["戻す", "もどす", "되돌리다"],
        ["彼", "かれ", "그"],
        ["間", "あいだ", "사이"],
        ["表面", "ひょうめん", "표면"],
        ["観察", "かんさつ", "관찰"],
        ["得意", "とくい", "잘함, 자신 있음"],
        ["会社", "かいしゃ", "회사"],
        ["反対", "はんたい", "반대"],
        ["方向", "ほうこう", "방향"],
        ["乗る", "のる", "타다"],
        ["枝", "えだ", "가지"],
        ["折る", "おる", "꺾다"],
        ["遠い", "とおい", "멀다"],
        ["短い", "みじかい", "짧다"],
        ["学期", "がっき", "학기"],
        ["授業", "じゅぎょう", "수업"],
        ["内容", "ないよう", "내용"],
        ["説明", "せつめい", "설명"],
        ["悩み", "なやみ", "고민"],
        ["相談", "そうだん", "상담"],
        ["新入社員", "しんにゅうしゃいん", "신입사원"],
        ["営業", "えいぎょう", "영업"],
        ["向いている", "むいている", "적성에 맞다"],
        ["場所", "ばしょ", "장소"],
        ["閉じる", "とじる", "닫다"],
        ["子供", "こども", "아이"],
        ["住む", "すむ", "살다"],
        ["庭", "にわ", "정원"]
      ]
    },

    {
      day: '2일차 (26.05.09)',
      words: [
        ["書類", "しょるい", "서류"],
        ["検討", "けんとう", "검토"],
        ["朝食", "ちょうしょく", "아침 식사"],
        ["簡単", "かんたん", "간단"],
        ["済ます", "すます", "끝내다"],
        ["包む", "つつむ", "싸다, 포장하다"],
        ["肩", "かた", "어깨"],
        ["首", "くび", "목"],
        ["腰", "こし", "허리"],
        ["指", "ゆび", "손가락"],
        ["痛める", "いためる", "다치게 하다"],
        ["病院", "びょういん", "병원"],
        ["通う", "かよう", "다니다"],
        ["習う", "ならう", "배우다"],
        ["単語", "たんご", "단어"],
        ["会話", "かいわ", "회화"],
        ["使う", "つかう", "사용하다"],
        ["近所", "きんじょ", "근처"],
        ["寝る", "ねる", "자다"],
        ["交通", "こうつう", "교통"],
        ["便利", "べんり", "편리"],
        ["夕飯", "ゆうはん", "저녁 식사"],
        ["合格", "ごうかく", "합격"],
        ["祝い", "いわい", "축하"],
        ["贈る", "おくる", "선물하다"],
        ["太い", "ふとい", "굵다"],
        ["地域", "ちいき", "지역"],
        ["交流", "こうりゅう", "교류"],
        ["参加", "さんか", "참가"]
      ]
    },
    {
      day: '3일차 (26.05.11)',
      words: [
        ["最近", "さいきん", "최근"],
        ["出勤", "しゅっきん", "출근"],
        ["出張", "しゅっちょう", "출장"],
        ["出席", "しゅっせき", "출석"],
        ["関する", "かんする", "~에 관한"],
        ["評判", "ひょうばん", "평판"],
        ["体験的", "たいけんてき", "체험적"],
        ["学習", "がくしゅう", "학습"],
        ["公共", "こうきょう", "공공"],
        ["移住", "いじゅう", "이주"],
        ["物価", "ぶっか", "물가"],
        ["代金", "だいきん", "대금"],
        ["合計", "ごうけい", "합계"],
        ["値段", "ねだん", "가격"],
        ["好物", "こうぶつ", "좋아하는 음식"],
        ["隣の席", "となりのせき", "옆 자리"],
        ["急に", "きゅうに", "갑자기"],
        ["持つ", "もつ", "가지다"],
        ["比較", "ひかく", "비교"],
        ["点検", "てんけん", "점검"],
        ["絵", "え", "그림"],
        ["小説", "しょうせつ", "소설"],
        ["得る", "える", "얻다"],
        ["描く", "かく", "그리다"],
        ["練習", "れんしゅう", "연습"],
        ["勤務", "きんむ", "근무"],
        ["規則違反", "きそくいはん", "규칙 위반"],
        ["以外", "いがい", "~이외"],
        ["可能性", "かのうせい", "가능성"],
        ["非常に", "ひじょうに", "매우"]
      ]
    },
    {
      day: '4일차 (26.05.12)',
      words: [
        ["移動", "いどう", "이동"],
        ["大変", "たいへん", "힘듦, 큰일"],
        ["面接", "めんせつ", "면접"],
        ["目標", "もくひょう", "목표"],
        ["解決", "かいけつ", "해결"],
        ["問題", "もんだい", "문제"],
        ["預ける", "あずける", "맡기다"],
        ["飛行機", "ひこうき", "비행기"],
        ["荷物", "にもつ", "짐"],
        ["大切", "たいせつ", "소중함, 중요함"],
        ["期待", "きたい", "기대"],
        ["違う", "ちがう", "다르다"],
        ["意味", "いみ", "의미"],
        ["洗う", "あらう", "씻다"],
        ["連絡", "れんらく", "연락"],
        ["住所", "じゅうしょ", "주소"],
        ["間違い", "まちがい", "실수, 틀림"],
        ["集中", "しゅうちゅう", "집중"],
        ["別の用事", "べつのようじ", "다른 용무"],
        ["親", "おや", "부모"],
        ["方法", "ほうほう", "방법"],
        ["嫌がる", "いやがる", "싫어하다"],
        ["会議室", "かいぎしつ", "회의실"],
        ["片付ける", "かたづける", "정리하다"]
      ]
    },
    {
      day: '5일차 (26.05.23)',
      words: [
        ["事情", "じじょう", "사정"],
        ["退社", "たいしゃ", "퇴사"],
        ["日時", "にちじ", "일시"],
        ["会費", "かいひ", "회비"],
        ["人数", "にんずう", "인원수"],
        ["確認", "かくにん", "확인"],
        ["含まれる", "ふくまれる", "포함되다"],
        ["遠足", "えんそく", "소풍"],
        ["当日", "とうじつ", "당일"],
        ["準備", "じゅんび", "준비"],
        ["手軽に", "てがるに", "간편하게"],
        ["着替え", "きがえ", "갈아입을 옷, 갈아입기"],
        ["遊び", "あそび", "놀이"],
        ["以降", "いこう", "이후"],
        ["変更", "へんこう", "변경"],
        ["資料", "しりょう", "자료"],
        ["毎回", "まいかい", "매번"],
        ["打ち合わせ", "うちあわせ", "회의, 사전 협의"],
        ["確認", "かくにん", "확인"],
        ["体重", "たいじゅう", "체중"],
        ["体調を崩す", "たいちょうをくずす", "몸 상태가 나빠지다"],
        ["大切", "たいせつ", "소중함, 중요함"],
        ["開かれる", "ひらかれる", "열리다"],
        ["欠かさず", "かかさず", "빠짐없이"]
      ]
    },
    {
      day: '6일차 (26.05.24)',
      words: [
        ["周り", "まわり", "주변"],
        ["細かい", "こまかい", "세밀하다, 잘다"],
        ["憧れる", "あこがれる", "동경하다"],
        ["現在", "げんざい", "현재"],
        ["映る", "うつる", "비치다, 나오다"],
        ["厳しい", "きびしい", "엄격하다"],
        ["複雑", "ふくざつ", "복잡"],
        ["管理", "かんり", "관리"],
        ["許可", "きょか", "허가"],
        ["想像", "そうぞう", "상상"],
        ["～通り", "～どおり", "~대로"],
        ["育てる", "そだてる", "기르다, 키우다"],
        ["過ごす", "すごす", "보내다"],
        ["努力", "どりょく", "노력"],
        ["責任", "せきにん", "책임"],
        ["囲む", "かこむ", "둘러싸다"],
        ["自然", "しぜん", "자연"],
        ["島/都市", "しま/とし", "섬/도시"],
        ["～に比べて", "～にくらべて", "~에 비해"],
        ["落ち着く", "おちつく", "침착해지다, 안정되다"],
        ["自慢", "じまん", "자랑"],
        ["移住", "いじゅう", "이주"],
        ["募集", "ぼしゅう", "모집"],
        ["貸す", "かす", "빌려주다"],
        ["短期間", "たんきかん", "단기간"],
        ["慣れる", "なれる", "익숙해지다"],
        ["環境", "かんきょう", "환경"],
        ["進める", "すすめる", "진행하다, 권하다"],
        ["間違う", "まちがう", "틀리다"],
        ["経つ", "たつ", "지나다"],
        ["問い合わせ", "といあわせ", "문의"],
        ["多数", "たすう", "다수"],
        ["魅力", "みりょく", "매력"]
      ]
    },
    {
      day: '7일차 (26.05.25)',
      words: [
        ["各人", "かくじん", "각자"],
        ["登録", "とうろく", "등록"],
        ["増加", "ぞうか", "증가"],
        ["違反", "いはん", "위반"],
        ["判断", "はんだん", "판단"],
        ["行為", "こうい", "행위"],
        ["迷惑をかける", "めいわくをかける", "폐를 끼치다"],
        ["伝える", "つたえる", "전하다"],
        ["終わる", "おわる", "끝나다"],
        ["決まり事", "きまりごと", "규칙, 정한 일"],
        ["配慮", "はいりょ", "배려"],
        ["快適に", "かいてきに", "쾌적하게"],
        ["意識", "いしき", "의식"],
        ["利用券", "りようけん", "이용권"],
        ["体育館", "たいいくかん", "체육관"],
        ["事前に", "じぜんに", "사전에"],
        ["事務所", "じむしょ", "사무실"],
        ["種類", "しゅるい", "종류"],
        ["窓口", "まどぐち", "창구"],
        ["購入", "こうにゅう", "구매"],
        ["希望", "きぼう", "희망"],
        ["確認", "かくにん", "확인"],
        ["割引", "わりびき", "할인"],
        ["禁止", "きんし", "금지"]
      ]
    }
  ]

  return (
    <div className="container">
      <Routes>
        <Route path="/" element={<Home kanjiArr={kanjiArr} />} />
        <Route path="/study/:id" element={<Study kanjiArr={kanjiArr} />} />
      </Routes>
    </div>
  )
}

export default App


function Home({ kanjiArr }) {
  return (
    <div className="dayContainer">

      <div className='title'>일본어 한자 공부 프로그램</div>

      <div className="day">
        {
          kanjiArr.map((a, i) => {
            return (
              <div key={i}>
                <Link to={`/study/${a.day}`} className="selectDay">
                  {a.day}
                </Link>
              </div>
            )
          })
        }
      </div>
    </div>
  )
}

function Study({ kanjiArr }) {

  const { id } = useParams();

  const currentDay = kanjiArr.find(a => a.day === id);
  const shuffledWords = [...currentDay.words].sort(() => Math.random() - 0.5);

  const [wordIndex, setWordIndex] = useState(0);
  const [showAnswer, setShowAnswer] = useState(false);
  const currentWord = shuffledWords[wordIndex];

  const nextWord = () => {
    if (wordIndex >= shuffledWords.length - 1) {
      setWordIndex(0);
    } else {
      setWordIndex(wordIndex + 1);
    }
    setShowAnswer(false);
  };

  const prevWord = () => {
    if (wordIndex === 0) {
      setWordIndex(shuffledWords.length - 1);
    } else {
      setWordIndex(wordIndex - 1);
    }
    setShowAnswer(false);
  };

  return (
    <div>

      <div className="dayHeader">
        {id}
      </div>

      <Link to="/" className="back">
        돌아가기
      </Link>

      <div className="words">

        <div className="selectWord">

          <div>{wordIndex + 1} / {currentDay.words.length}</div>
          <div className="kanji">{currentWord[0]}</div>

          {
            showAnswer &&
            <>
              <div className="reading">{currentWord[1]}</div>
              <div className="meaning">{currentWord[2]}</div>
            </>
          }

          <div className="btns">

            <button onClick={prevWord} className="changeWord">
              이전
            </button>

            <button onClick={() => setShowAnswer(!showAnswer)} className="answerBtn">
              {
                showAnswer
                  ? "숨기기"
                  : "발음 / 뜻 보기"
              }
            </button>

            <button onClick={nextWord} className="changeWord">
              다음
            </button>

          </div>
        </div>
      </div>
    </div>
  )
}